# Pandas library 

Pandas is the main library in data analysis for Python. It includes several new datatypes used for studying tabular data and sequences. It is built on top of Numpy, so it has several connections with this library. In the graphic part, it has its own graphic module built in Matplotlib, but its connection with Seaborn is usually more powerful.

In [1]:
import numpy as np
import pandas as pd

### Pandas Series

Series are the most basic pandas-defined structures. They are used to study sequences of values. They are very similar to numpy arrays but in a combination with a dictionary. What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

### Creating a series

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
#pd.Series(arr,index=labels) #from a numpy array
#pd.Series(data=d) #from a dictionary
#pd.Series(data=my_list,index=labels) # from two lists, data and index

Also, the data may not be numeric, strings for example are also avaialable.

In [4]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

### Functionality of Pandas Series

The index usually has a meaning, related to the way we are accesing the data in the future.

In [5]:
ser1 = pd.Series([10,20,30,40],index = ['Madrid', 'Barcelona','Sevilla', 'Valencia']) 
ser1

Madrid       10
Barcelona    20
Sevilla      30
Valencia     40
dtype: int64

In [6]:
ser1["Madrid"]

10

### Operations with Series

Sum is provided, and it sums the values with the same index, leaving a NaN where there is no information.

In [7]:
ser2 = pd.Series([10,20,20,40],index = ['Madrid', 'Cádiz','Sevilla', 'Barcelona'])

In [8]:
ser1 + ser2

Barcelona    60.0
Cádiz         NaN
Madrid       20.0
Sevilla      50.0
Valencia      NaN
dtype: float64

## Pandas DataFrames

We can think of a DataFrame as a bunch of Series objects put together to share the same index. They are inspired in the R language and are the main object used in Python data analysis projects.

In [9]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A -1.301108 -0.015679 -1.035618 -0.303252
B -1.718755  0.531014 -1.470471 -0.039898
C -0.317106 -1.837657  1.042565  0.240121
D  0.752255 -1.055463 -0.821660  0.922159
E -0.390417 -0.095208 -0.910883 -0.160497

In a dataframe, besides index, we have columns, and this is the main parameter that is added in their definition.

### Selection of data

In [10]:
df['W']

A   -1.301108
B   -1.718755
C   -0.317106
D    0.752255
E   -0.390417
Name: W, dtype: float64

In [11]:
df[["W","Y"]]

          W         Y
A -1.301108 -1.035618
B -1.718755 -1.470471
C -0.317106  1.042565
D  0.752255 -0.821660
E -0.390417 -0.910883

Columns provide the basic math operations. Also, a new columns is defined as it would be a dictionary, defining its name as the key.

In [12]:
df['new'] = df['W'] + df['Y']

In [13]:
df

          W         X         Y         Z       new
A -1.301108 -0.015679 -1.035618 -0.303252 -2.336726
B -1.718755  0.531014 -1.470471 -0.039898 -3.189226
C -0.317106 -1.837657  1.042565  0.240121  0.725459
D  0.752255 -1.055463 -0.821660  0.922159 -0.069406
E -0.390417 -0.095208 -0.910883 -0.160497 -1.301300

### Delete columns 

The keyword axis will be important to define the direction in which a certain operation has to be applied.

In [14]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.301108 -0.015679 -1.035618 -0.303252
B -1.718755  0.531014 -1.470471 -0.039898
C -0.317106 -1.837657  1.042565  0.240121
D  0.752255 -1.055463 -0.821660  0.922159
E -0.390417 -0.095208 -0.910883 -0.160497

In [15]:
df.drop('E',axis=0)

          W         X         Y         Z       new
A -1.301108 -0.015679 -1.035618 -0.303252 -2.336726
B -1.718755  0.531014 -1.470471 -0.039898 -3.189226
C -0.317106 -1.837657  1.042565  0.240121  0.725459
D  0.752255 -1.055463 -0.821660  0.922159 -0.069406

Another important keyword is inplace

In [16]:
df

          W         X         Y         Z       new
A -1.301108 -0.015679 -1.035618 -0.303252 -2.336726
B -1.718755  0.531014 -1.470471 -0.039898 -3.189226
C -0.317106 -1.837657  1.042565  0.240121  0.725459
D  0.752255 -1.055463 -0.821660  0.922159 -0.069406
E -0.390417 -0.095208 -0.910883 -0.160497 -1.301300

In [17]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A -1.301108 -0.015679 -1.035618 -0.303252
B -1.718755  0.531014 -1.470471 -0.039898
C -0.317106 -1.837657  1.042565  0.240121
D  0.752255 -1.055463 -0.821660  0.922159
E -0.390417 -0.095208 -0.910883 -0.160497

### Data selection

The command .loc allows us to select rows or columns based on names of index and labels

In [18]:
df.loc['A']

W   -1.301108
X   -0.015679
Y   -1.035618
Z   -0.303252
Name: A, dtype: float64

In [19]:
df.loc[:,"Y"]

A   -1.035618
B   -1.470471
C    1.042565
D   -0.821660
E   -0.910883
Name: Y, dtype: float64

But selection can be done also using the position of a row

In [20]:
df.iloc[2]

W   -0.317106
X   -1.837657
Y    1.042565
Z    0.240121
Name: C, dtype: float64

Selection of groups is provided with .loc

In [21]:
df.loc['B','Y']

-1.4704714721905507

In [22]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.301108 -1.035618
B -1.718755 -1.470471

### Conditional selection

Another feature that is implemented is the selection based on a condition. Given a df

In [23]:
df

          W         X         Y         Z
A -1.301108 -0.015679 -1.035618 -0.303252
B -1.718755  0.531014 -1.470471 -0.039898
C -0.317106 -1.837657  1.042565  0.240121
D  0.752255 -1.055463 -0.821660  0.922159
E -0.390417 -0.095208 -0.910883 -0.160497

In [24]:
df>0

       W      X      Y      Z
A  False  False  False  False
B  False   True  False  False
C  False  False   True   True
D   True  False  False   True
E  False  False  False  False

In [25]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B       NaN  0.531014       NaN       NaN
C       NaN       NaN  1.042565  0.240121
D  0.752255       NaN       NaN  0.922159
E       NaN       NaN       NaN       NaN

The condition may be based on a single columns

In [26]:
df[df['W']>0]

          W         X        Y         Z
D  0.752255 -1.055463 -0.82166  0.922159

And mix with selection

In [27]:
df[df['W']>0][['Y','X']]

         Y         X
D -0.82166 -1.055463

For two conditions you can use | and & with parenthesis:

In [28]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

### Index

Dataframes support hierarchy on indexing. This means that we can group our data using several index and move them in and out using columns.

In [29]:
df

          W         X         Y         Z
A -1.301108 -0.015679 -1.035618 -0.303252
B -1.718755  0.531014 -1.470471 -0.039898
C -0.317106 -1.837657  1.042565  0.240121
D  0.752255 -1.055463 -0.821660  0.922159
E -0.390417 -0.095208 -0.910883 -0.160497

In [30]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.301108 -0.015679 -1.035618 -0.303252
1     B -1.718755  0.531014 -1.470471 -0.039898
2     C -0.317106 -1.837657  1.042565  0.240121
3     D  0.752255 -1.055463 -0.821660  0.922159
4     E -0.390417 -0.095208 -0.910883 -0.160497

We can create a new column and include it as index

In [31]:
indice = 'Z X C V B'.split()

In [32]:
df['new_ind'] = indice

In [33]:
df

          W         X         Y         Z new_ind
A -1.301108 -0.015679 -1.035618 -0.303252       Z
B -1.718755  0.531014 -1.470471 -0.039898       X
C -0.317106 -1.837657  1.042565  0.240121       C
D  0.752255 -1.055463 -0.821660  0.922159       V
E -0.390417 -0.095208 -0.910883 -0.160497       B

In [34]:
df.set_index('new_ind',inplace=True)

In [35]:
df

                W         X         Y         Z
new_ind
Z       -1.301108 -0.015679 -1.035618 -0.303252
X       -1.718755  0.531014 -1.470471 -0.039898
C       -0.317106 -1.837657  1.042565  0.240121
V        0.752255 -1.055463 -0.821660  0.922159
B       -0.390417 -0.095208 -0.910883 -0.160497

Hierarchy and multi index

In [36]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [37]:
df_2 = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df_2

             A         B
G1 1  1.032497 -0.899092
   2  0.955690  0.031980
   3  0.521865  0.478215
G2 1  0.665719  2.565599
   2  0.254257 -1.361694
   3 -0.641808  0.559932

Set_index also allows us to proceed like this, introducing a length 2 list

In [38]:
df.reset_index().set_index(["W","X"])

                    new_ind         Y         Z
W         X
-1.301108 -0.015679       Z -1.035618 -0.303252
-1.718755  0.531014       X -1.470471 -0.039898
-0.317106 -1.837657       C  1.042565  0.240121
 0.752255 -1.055463       V -0.821660  0.922159
-0.390417 -0.095208       B -0.910883 -0.160497

Selection on Multi Index allows us to select group directly

In [39]:
df_2.loc['G1']

          A         B
1  1.032497 -0.899092
2  0.955690  0.031980
3  0.521865  0.478215

In [40]:
df_2.loc['G1'].loc[1]

A    1.032497
B   -0.899092
Name: 1, dtype: float64

In [41]:
df_2.index.names = ['Group','Num']

In [42]:
df_2

                  A         B
Group Num
G1    1    1.032497 -0.899092
      2    0.955690  0.031980
      3    0.521865  0.478215
G2    1    0.665719  2.565599
      2    0.254257 -1.361694
      3   -0.641808  0.559932

In [43]:
df_2.xs(('G1',1))

A    1.032497
B   -0.899092
Name: (G1, 1), dtype: float64

In [44]:
df_2.xs(1,level='Num')

              A         B
Group
G1     1.032497 -0.899092
G2     0.665719  2.565599

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas: the functions fillna and dropna

In [45]:
df_3 = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [46]:
df_3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [47]:
df_3.dropna()

     A    B  C
0  1.0  5.0  1

In [48]:
df_3.dropna(axis=1)

   C
0  1
1  2
2  3

In [49]:
df_3.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

### Exercises

We reuse the titanic dataset, .head() allows us to check the first values of the DataFrame

In [55]:
import seaborn as sns

In [56]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

Select the values where age is greater than 25. Then select the fare column and calculate the mean. Use .mean() to calculate this value.

Calculate the number of survivors (survived == 1) of the titanic, and the percentage. len(df) allows you to calculate the number of rows. It may be useful

Create a new dataframe that includes only the sex, fare and fare columns. Then calculate the mean fare for men and women.